In [1]:
import pandas as pd
import sqlite3
import warnings
warnings.filterwarnings("ignore")

## Create a Connection

In [3]:
conn=sqlite3.connect("example2.db")
cur=conn.cursor()
cur.execute("Select * from customer")
cur.fetchall()

[('Mark', 5000.0), ('John', 4000.0), ('Ram', 6500.0)]

## Create a Dataframe

In [4]:
df=pd.read_sql_query("Select * from customer",conn)
df

   Name  Income
0  Mark  5000.0
1  John  4000.0
2   Ram  6500.0

## Run queries from Pandas

In [5]:
pd.read_sql("Select * from customer",conn)

   Name  Income
0  Mark  5000.0
1  John  4000.0
2   Ram  6500.0

## Read csv file from Pandas

In [6]:
pd.read_csv("sample.csv")

      Name  Age
0      Ram   21
1    Vikas   25
2   Mahesh   42
3  Sandeep   33

In [7]:
sample_df=pd.read_csv("sample.csv")

In [8]:
sample_df

      Name  Age
0      Ram   21
1    Vikas   25
2   Mahesh   42
3  Sandeep   33

In [9]:
type(sample_df)

pandas.core.frame.DataFrame

In [10]:
sample_df.head()

      Name  Age
0      Ram   21
1    Vikas   25
2   Mahesh   42
3  Sandeep   33

## Create a table in SQLite from a csv file with Python

In [11]:
sample_df=pd.read_csv("sample.csv")

In [12]:
sample_df.to_sql("Sample_Table",conn,if_exists="replace",index=False)

4

In [14]:
pd.read_sql("Select * from Sample_Table",conn)

      Name  Age
0      Ram   21
1    Vikas   25
2   Mahesh   42
3  Sandeep   33

# Extracting Table info with Python

## Function to get all table info

In [38]:
conn = sqlite3.connect("example2.db")
cur = conn.cursor()

In [45]:
def table_info(conn,cursor):
    
    tables=cur.execute("Select name from sqlite_master Where type='table';").fetchall()
    for table_name in tables:
        table_name=table_name[0]
        table=pd.read_sql_query("Select * from {} LIMIT 0".format(table_name),conn)
        print(table_name)       
        for col in table.columns:
            print("\t "+col)
            print()

In [46]:
table_info(conn,cur)

customer
	 Name

	 Income

Sample_Table
	 Name

	 Age

## See table schema with SQlite

In [47]:
cur.execute("PRAGMA table_info('customer')").fetchall()

[(0, 'Name', 'TEXT', 0, None, 0), (1, 'Income', 'REAL', 0, None, 0)]

Every row includes:

Index of the column
Column Name
Data type
Whether or not the column can be NULL
The default value for the column
The primary key in the result is 0 for columns that are not the primary key